/** @file
 brief description of file's purpose.

 detailed description of file's purpose

;******************************************************************************
;* Copyright 2022 Insyde Software Corp. All Rights Reserved.
;*
;* You may not reproduce, distribute, publish, display, perform, modify, adapt,
;* transmit, broadcast, present, recite, release, license or otherwise exploit
;* any part of this publication in any form, by any means, without the prior
;* written permission of Insyde Software Corp.
;*
;******************************************************************************
*/

#langdef en-US "English"

//
// The following are used during development, that won't be included in the official version
//
#string STR_TBD                                     #language en-US        "T.B.D."

#string STR_EMPTY                                   #language en-US        ""
#string STR_NA                                      #language en-US        "N/A"
#string STR_NULL                                    #language en-US        "NULL"
#string STR_NO_DEVICE                               #language en-US        " No Device"
#string STR_GO_BACK                                 #language en-US        "Go Back"
#string STR_GO_BACK_HELP                            #language en-US        "Back to Last Page."
#string STR_DEVICE_CHANGING_STAT                    #language en-US        ""

#string STR_SD_EMMC_INFO_TITLE                      #language en-US        "SD/eMMC Information"
#string STR_SD_EMMC_SUB_FORM_TITLE                  #language en-US        "SD/eMMC Information"
#string STR_SD_EMMC_INFO_TITLE_HELP                 #language en-US        "SD/eMMC Info Menu"

#string STR_SD_EMMC_EMMC                            #language en-US         "eMMC"
#string STR_SD_EMMC_SD                              #language en-US         "SD"

#string STR_SD_EMMC_DISPLAY_MODE_PROMPT             #language en-US         "Display Mode"
#string STR_SD_EMMC_DISPLAY_MODE_HELP               #language en-US         "Select a display mode of device list."
#string STR_SD_EMMC_DISPLAY_MODE_BY_TYPE            #language en-US         "By Types"
#string STR_SD_EMMC_DISPLAY_MODE_BY_OEM_NAME        #language en-US         "By Ports"

#string STR_SD_EMMC_DEVPATH_PROMPT                  #language en-US         "Device Path"
#string STR_SD_EMMC_DEVPATH_HELP                    #language en-US         "N/A"
#string STR_SD_EMMC_DRIVENAME_PROMPT                #language en-US         "Product Name"
#string STR_SD_EMMC_DRIVENAME_HELP                  #language en-US         "The product name is a ASCII string."
#string STR_SD_EMMC_CAPACITY_PROMPT                 #language en-US         "Device Capacity"
#string STR_SD_EMMC_CAPACITY_HELP                   #language en-US         "Total device capacity."
#string STR_SD_EMMC_SERIAL_NUM_PROMPT               #language en-US         "Device Serial Number"
#string STR_SD_EMMC_SERIAL_NUM_HELP                 #language en-US         "The serial number is 32 bits binary number."
#string STR_SD_EMMC_REVISION_PROMPT                 #language en-US         "Device Revision"
#string STR_SD_EMMC_REVISION_HELP                   #language en-US         "The product revision is composed of two binary code decimal(BCD) debits, four bits each, representing an "n.m" revision number. The "n" is the most significant nibble and "m" is the least significant nibble."
#string STR_SD_EMMC_OEM_APP_ID_PROMPT               #language en-US         "OEM/Application ID"
#string STR_SD_EMMC_OEM_APP_ID_HELP                 #language en-US         "A ASCII string that identifies the card OEM and/or the card contents"
#string STR_SD_EMMC_MANU_ID_PROMPT                  #language en-US         "Manufacture ID"
#string STR_SD_EMMC_MANU_ID_HELP                    #language en-US         "An 8-bit binary number that identifies the card manufacturer."
#string STR_SD_EMMC_MANU_DATE_PROMPT                #language en-US         "Manufacture Date"
#string STR_SD_EMMC_MANU_DATE_HELP                  #language en-US         "The manufactureing date is composed of two hexadecimal digits, one is 8 bits representing the year and the other is 4bits representing the month."
#string STR_SD_EMMC_CARD_TYPE_PROMPT                #language en-US         "Card Type"
#string STR_SD_EMMC_CARD_TYPE_HELP                  #language en-US         "An 16-bit binary number that identifies the card type."
#string STR_SD_EMMC_BLOCK_COUNT_PROMPT              #language en-US         "Block Count"
#string STR_SD_EMMC_BLOCK_COUNT_HELP                #language en-US         "The number of data blocks that can be read out of the cards."
#string STR_SD_EMMC_BLOCK_SIZE_PROMPT               #language en-US         "Block Size"
#string STR_SD_EMMC_BLOCK_SIZE_HELP                 #language en-US         "The number of block length of the cards."


